app/controllers/appoinments_controller.rb

SELECT "appointments"."id", "appointments"."start_at", "appointments"."ends_at" FROM "appointments" WHERE "appointments"."doctor_id" = ? AND "appointments"."date" = ?  [["doctor_id", 1], ["date", "2023-09-08"]]
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "appointments" ("start_at", "ends_at", "date", "created_at", "updated_at", "doctor_id", "patient_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["start_at", 1720], ["ends_at", 1750], ["date", "2023-09-08"], ["created_at", "2023-09-09 00:38:10.505529"], ["updated_at", "2023-09-09 00:38:10.505529"], ["doctor_id", 1], ["patient_id", 1]]
---
  def create(render = true)
    Date.strptime(params[:date], "%Y-%m-%d") rescue return render json: {"error": "Bad date"}, status: :bad_request

    appointment = Appointment.new
    appointment.doctor_id = params[:doctor_id]
    appointment.start_at = params[:start_at]
    appointment.ends_at = params[:ends_at]
    appointment.date = params[:date]
    appointment.patient_id = params[:patient_id]

    unless appointment.valid?
      return render json: {"error": appointment.errors}, status: :bad_request if render
      return false
    end

    doctor = Doctor.find(appointment.doctor_id)
    unless doctor.is_available?(appointment.date, appointment.start_at, appointment.ends_at)
      return render json: {"error": "doctor is not available"}, status: :forbidden if render
      return false
    end

    if appointment.save!

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 9]]
---
  def delete(render = true)
    begin
      appointment = Appointment.find(params[:id])
      appointment.delete