app/controllers/doctors_controller.rb

  def index
    doctors = Doctor.select(:id, :name).includes(:working_days)
---
SELECT "doctors"."id", "doctors"."name" FROM "doctors"
SELECT "working_days".* FROM "working_days" WHERE "working_days"."doctor_id" IN (?, ?, ?)  [["doctor_id", 1], ["doctor_id", 2], ["doctor_id", 3]]

  def available_time
    begin
      Date.strptime(params[:date], "%Y-%m-%d") rescue return render json: {"error": "Bad date"}, status: :bad_request
      doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]