app/models/doctor.rb

SELECT "working_days".* FROM "working_days" WHERE "working_days"."doctor_id" = ?  [["doctor_id", 1]]
---
  def is_working?(day, start_time, end_time)
    self.working_days.each do | wd |

SELECT "working_days".* FROM "working_days" WHERE "working_days"."doctor_id" = ?  [["doctor_id", 1]]
---
  def working_time(day)
    wd = self.working_days.select{ |w| w.day == day}

SELECT "appointments"."start_at", "appointments"."ends_at" FROM "appointments" WHERE "appointments"."doctor_id" = ? AND "appointments"."date" = ? ORDER BY "appointments"."start_at" ASC  [["doctor_id", 1], ["date", "2023-09-09"]]
---
  def available_slots(date)
    # Take dayname
    free_slots_day = date.to_time.strftime("%A").downcase
    # Get working time for that day
    day_time_slots = self.working_time(free_slots_day)
    # Get appointments
    appointments = Appointment.by_doctor_and_date( self.id, date).order(start_at: :asc).pluck(:start_at, :ends_at)